; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	image0 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation1 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument2 image0)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument3 image1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star0)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(have_image Planet5 image0)
	(have_image Planet6 image1)
	(have_image Planet7 image0)
	(have_image Phenomenon8 image0)
	(have_image Star9 image1)
	(have_image Planet10 image1)
))

)

; plan
1. (turn_to satellite0 groundstation1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet5)
   goals met: 0 of 7
5. (take_image satellite0 planet5 instrument0 image0)
   added: (have_image planet5 image0)
   goals met: 1 of 7
6. (turn_to satellite0 planet10 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet10)
   goals met: 1 of 7
7. (take_image satellite0 planet10 instrument0 image1)
   added: (have_image planet10 image1)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon8 instrument0 image0)
   added: (have_image phenomenon8 image0)
   goals met: 3 of 7
10. (turn_to satellite0 planet6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet6)
   goals met: 3 of 7
11. (take_image satellite0 planet6 instrument0 image1)
   added: (have_image planet6 image1)
   goals met: 4 of 7
12. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 4 of 7
13. (take_image satellite0 planet7 instrument0 image0)
   added: (have_image planet7 image0)
   goals met: 5 of 7
14. (turn_to satellite0 star9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star9)
   goals met: 5 of 7
15. (take_image satellite0 star9 instrument0 image1)
   added: (have_image star9 image1)
   goals met: 6 of 7
16. (turn_to satellite1 groundstation2 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 groundstation2)
   goals met: 7 of 7
